---
title: PaperSourceSet
classe: Autodesk.Revit.DB.PaperSourceSet
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# PaperSourceSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `paperSourceSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `paperSourceSet.Size` | Int32 |
| `Void Clear()` | `paperSourceSet.Clear()` | Void |
| `Boolean Contains(PaperSource)` | `paperSourceSet.Contains(item)` | Boolean |
| `Int32 Erase(PaperSource)` | `paperSourceSet.Erase(item)` | Int32 |
| `PaperSourceSetIterator ForwardIterator()` | `paperSourceSet.ForwardIterator()` | PaperSourceSetIterator |
| `IEnumerator GetEnumerator()` | `paperSourceSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(PaperSource)` | `paperSourceSet.Insert(item)` | Boolean |
| `PaperSourceSetIterator ReverseIterator()` | `paperSourceSet.ReverseIterator()` | PaperSourceSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```